const suggest_list = {
  "生鳳梨" : [
    "未成熟的鳳梨中含有較多的菠蘿蛋白酶、苷類物質和維生素c，這些物質具有一定的刺激性，食用後會對人體的組織器官造成一定的傷害，因此如果是切開後不熟的鳳梨，那麼不建議再繼續食用。",
    "鳳梨具有後熟的性質，如果是整個完整鳳梨的話，那麼放置一段時間之後是可以自行成熟的，但如果是已經將鳳梨切開了，那麼鳳梨中所含的一些成分就會與空氣中的氧氣發生反應，因此切開之後的鳳梨是不能放熟的。",
    "生鳳梨切開後容易滋生細菌，所以不能放置催熟了，如果擔心它會變質不能食用，可以換成其他的吃法，例如榨汁，都是很不錯的哦！"
  ],
  "熟鳳梨" : "適合直接食用，若怕咬舌可以抹上少許鹽巴，削皮後建議當天食用完畢。",
  "過熟鳳梨" : "過熟鳳梨適合做成果醬，也適合做成各式料理，例如鳳梨苦瓜雞、煮湯等等。",
};

const knowledge_list = [
  '哥倫布不只發現新大陸，更發現鳳梨，將其帶回歐洲。',
  '鳳梨是因為其葉子像鳳尾，形狀像梨子，故稱其為鳳梨。而其果肉是君王之色，又稱王梨。',
  '鳳梨的頭並不是葉子那邊，而是看起來像底部的才是鳳梨頭。',
  '鳳梨頭，西瓜尾是指鳳梨的頭部與西瓜的尾部吃起來特別甜，是因為鳳梨頭是最先成熟度最高的。',
  '鳳梨咬舌是因為其中的鳳梨蛋白酶，在鳳梨上塗抹鹽可以避免咬舌。',
  '如同老婆餅裡面沒有老婆，鳳梨酥裡面也沒有鳳梨。',
  '鳳梨汁可以軟化肉質，因為其含有鳳梨蛋白酶。',
  '台灣早期的鳳梨罐頭外銷曾高達一年400萬箱。後續因生產成本提高而沒落。',
  '鳳梨不能和高蛋白食物一同食用，鳳梨含有大量植物酸，與高蛋白食物一同攝取會影響蛋白質吸收。',
  '鳳梨不能和蘿蔔一同食用，鳳梨的維生素C會被蘿蔔的維生素Ｃ酵酶破壞，此外，還有可能引發甲狀腺腫大。',
  '挑選鳳梨除了用顏色辨別外，可用手指輕彈鳳梨，聲音清響為鼓聲果，肉質較細膩且耐放，轉黃後風味較佳。'
];